wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/io/rtl876x_adc_def.h
/**
*********************************************************************************************************
*               Copyright(c) 2024, Realtek Semiconductor Corporation. All rights reserved.
*********************************************************************************************************
* \file     rtl876x_adc_def.h
* \brief    ADC related definitions
* \details
* \author
* \date
* \version  v1.0
* *********************************************************************************************************
*/

#ifndef RTL876X_ADC_DEF_H
#define RTL876X_ADC_DEF_H

#include <stdint.h>
#include <stdbool.h>
#include "rtl876x.h"

#ifdef  __cplusplus
extern "C" {
#endif /* __cplusplus */

/* ================================================================================ */
/* ================                  ADC  Defines                  ================ */
/* ================================================================================ */
/** \defgroup ADC_Exported_Constants ADC Exported Constants
  * \brief
  * \{
  */

/**
 * \defgroup ADC_Defines ADC Defines
 * \{
 * \ingroup  ADC_Exported_Constants
 */
#define CHIP_ADC_CHANNEL_NUM                           (8)
#define CHIP_ADC_SCHEDULE_NUM                          (16)
#define CHIP_ADC_MODE_OFFSET                           (3)
#define ADC_SUPPORT_DMA_EN                             (0)
#define ADC_SUPPORT_VADPIN_MODE                        (1)
#define ADC_SUPPORT_POWER_OFF                          (0)
#define ADC_SUPPORT_MANUAL_MODE                        (1)
#define ADC_SUPPORT_GET_RESULT                         (1)
#define ADC_DRIVER_NOT_MOVE_TO_PATCH                   (0)

/** End of ADC_Defines
  * \}
  */

/** End of ADC_Exported_Constants
  * \}
  */

/*============================================================================*
 *                         ADC Registers Memory Map
 *============================================================================*/
typedef struct
{
    __I  uint32_t ADC_FIFO_READ;              /*!< 0x00 */
    __IO uint32_t ADC_DIG_CTRL;               /*!< 0x04 */
    __IO uint32_t ADC_SCHED_CTRL;             /*!< 0x08 */
    __IO uint32_t ADC_CTRL_INT;               /*!< 0x0C */
    __IO uint16_t ADC_SCHTAB0;                /*!< 0x10 */
    __IO uint16_t ADC_SCHTAB1;
    __IO uint16_t ADC_SCHTAB2;                /*!< 0x14 */
    __IO uint16_t ADC_SCHTAB3;
    __IO uint16_t ADC_SCHTAB4;                /*!< 0x18 */
    __IO uint16_t ADC_SCHTAB5;
    __IO uint16_t ADC_SCHTAB6;                /*!< 0x1C */
    __IO uint16_t ADC_SCHTAB7;
    __IO uint16_t ADC_SCHTAB8;                /*!< 0x20 */
    __IO uint16_t ADC_SCHTAB9;
    __IO uint16_t ADC_SCHTAB10;               /*!< 0x24 */
    __IO uint16_t ADC_SCHTAB11;
    __IO uint16_t ADC_SCHTAB12;               /*!< 0x28 */
    __IO uint16_t ADC_SCHTAB13;
    __IO uint16_t ADC_SCHTAB14;               /*!< 0x2C */
    __IO uint16_t ADC_SCHTAB15;
    __I  uint16_t ADC_SCHD0;                  /*!< 0x30 */
    __I  uint16_t ADC_SCHD1;
    __I  uint16_t ADC_SCHD2;                  /*!< 0x34 */
    __I  uint16_t ADC_SCHD3;
    __I  uint16_t ADC_SCHD4;                  /*!< 0x38 */
    __I  uint16_t ADC_SCHD5;
    __I  uint16_t ADC_SCHD6;                  /*!< 0x3C */
    __I  uint16_t ADC_SCHD7;
    __I  uint16_t ADC_SCHD8;                  /*!< 0x40 */
    __I  uint16_t ADC_SCHD9;
    __I  uint16_t ADC_SCHD10;                 /*!< 0x44 */
    __I  uint16_t ADC_SCHD11;
    __I  uint16_t ADC_SCHD12;                 /*!< 0x48 */
    __I  uint16_t ADC_SCHD13;
    __I  uint16_t ADC_SCHD14;                 /*!< 0x4C */
    __I  uint16_t ADC_SCHD15;
    __IO uint32_t ADC_POW_DATA_DLY_CTRL;      /*!< 0x50 */
    __IO uint32_t ADC_DATA_CLK_CTRL;          /*!< 0x54 */
    __IO uint32_t ADC_ANALOG_CTRL;            /*!< 0x58 */
    __IO uint32_t ADC_TIME_PERIOD;            /*!< 0x5C */
    __O  uint32_t ADC_RTL_VERSION;            /*!< 0x60 */
} ADC_TypeDef;

/*============================================================================*
 *                         ADC Declaration
 *============================================================================*/
#define ADC                ((ADC_TypeDef *) AUX_ADC_BASE)

#define IS_ADC_PERIPH(PERIPH)   ((PERIPH) == ADC)
/*============================================================================*
 *                         ADC Registers and Field Descriptions
 *============================================================================*/
/**
* @brief Analog to digital converter. (ADC)
*/
/* 0x00
   15:0    R      adc_fifo_data_out               16'h0
   27:16   R      reserved00_27_16                12'h0
   31:28   R      adc_schedule_index              4'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t adc_fifo_data_out: 16;
        const uint32_t reserved_0: 12;
        const uint32_t adc_schedule_index: 4;
    } b;
} ADC_FIFO_READ_TypeDef;


/* 0x04
   0       R/W    en_adc_continous_mode           1'h0
   1       W1C    en_adc_one_shot_mode            1'h0
   2       R/W    adc_data_latch_edge             1'h0
   7:3     R      adc_fifo_wpt                    5'h0
   12:8    R      adc_fifo_rpt                    5'h0
   13      R/W    adc_fifo_overwrite              1'h0
   19:14   R/W    adc_burst_size                  6'h0
   25:20   R/W    adc_fifo_thd                    6'h0
   26      W1C    adc_fifo_clr                    1'h0
   27      R/W    adc_one_shot_fifo               1'h0
   29:28   R      reserved04_29_28                2'h0
   31:30   R/W    adc_dbg_sel                     2'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        uint32_t en_adc_continous_mode: 1;
        uint32_t en_adc_one_shot_mode: 1;
        uint32_t adc_data_latch_edge: 1;
        const uint32_t adc_fifo_wpt: 5;
        const uint32_t adc_fifo_rpt: 5;
        uint32_t adc_fifo_overwrite: 1;
        uint32_t adc_burst_size: 6;
        uint32_t adc_fifo_thd: 6;
        uint32_t adc_fifo_clr: 1;
        uint32_t adc_one_shot_fifo: 1;
        const uint32_t reserved_0: 2;
        uint32_t adc_dbg_sel: 2;
    } b;
} ADC_DIG_CTRL_TypeDef;


/* 0x08
   15:0    R/W    adc_schedule_idx_sel            16'h0
   21:16   R      adc_fifo_data_level             6'h0
   31:22   R      reserved08_31_22                10'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        uint32_t adc_schedule_idx_sel: 16;
        const uint32_t adc_fifo_data_level: 6;
        const uint32_t reserved_0: 10;
    } b;
} ADC_SCHED_CTRL_TypeDef;


/* 0x0C
   0       R/W    en_adc_fifio_rd_req_interrupt   1'h0
   1       R/W    en_adc_fifo_rd_error_interrupt  1'h0
   2       R/W    en_adc_fifo_thd_interrupt       1'h0
   3       R/W    en_adc_fifo_full_interrupt      1'h0
   4       R/W    en_adc_one_shot_done_interrupt  1'h0
   7:5     R      reserved0c_7_5                  3'h0
   8       W1C    clr_adc_fifio_rd_req_interrupt  1'h0
   9       W1C    clr_adc_fifo_rd_error_interrupt 1'h0
   10      W1C    clr_adc_fifo_thd_interrupt      1'h0
   11      W1C    clr_adc_fifo_full_interrupt     1'h0
   12      W1C    clr_adc_one_shot_done_interrupt 1'h0
   15:13   R      reserved0c_15_13                3'h0
   16      R      st_adc_fifio_rd_req_interrupt   1'h0
   17      R      st_adc_fifo_rd_error_interrupt  1'h0
   18      R      st_adc_fifo_thd_interrupt       1'h0
   19      R      st_adc_fifo_full_interrupt      1'h0
   20      R      st_adc_one_shot_done_interrupt  1'h0
   31:21   R      reserved0c_31_21                11'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        uint32_t en_adc_fifio_rd_req_interrupt: 1;
        uint32_t en_adc_fifo_rd_error_interrupt: 1;
        uint32_t en_adc_fifo_thd_interrupt: 1;
        uint32_t en_adc_fifo_full_interrupt: 1;
        uint32_t en_adc_one_shot_done_interrupt: 1;
        const uint32_t reserved_2: 3;
        uint32_t clr_adc_fifio_rd_req_interrupt: 1;
        uint32_t clr_adc_fifo_rd_error_interrupt: 1;
        uint32_t clr_adc_fifo_thd_interrupt: 1;
        uint32_t clr_adc_fifo_full_interrupt: 1;
        uint32_t clr_adc_one_shot_done_interrupt: 1;
        const uint32_t reserved_1: 3;
        const uint32_t st_adc_fifio_rd_req_interrupt: 1;
        const uint32_t st_adc_fifo_rd_error_interrupt: 1;
        const uint32_t st_adc_fifo_thd_interrupt: 1;
        const uint32_t st_adc_fifo_full_interrupt: 1;
        const uint32_t st_adc_one_shot_done_interrupt: 1;
        const uint32_t reserved_0: 11;
    } b;
} ADC_CTRL_INT_TypeDef;


