wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/io/rtl876x_adc_def.h
/* 0x10
   2:0     R/W    ch_num_idx0                     3'h0
   4:3     R/W    adc_mode_idx0                   2'h0
   15:5    R      reserved10_15_5                 11'h0
   18:16   R/W    ch_num_idx1                     3'h0
   20:19   R/W    adc_mode_idx1                   2'h0
   31:21   R      reserved10_31_21                11'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        uint32_t ch_num_idx0: 3;
        uint32_t adc_mode_idx0: 2;
        const uint32_t reserved_1: 11;
        uint32_t ch_num_idx1: 3;
        uint32_t adc_mode_idx1: 2;
        const uint32_t reserved_0: 11;
    } b;
} ADC_SCHED_TAB_IDX0_IDX1_TypeDef;


/* 0x14
   2:0     R/W    ch_num_idx2                     3'h0
   4:3     R/W    adc_mode_idx2                   2'h0
   15:5    R      reserved14_15_5                 11'h0
   18:16   R/W    ch_num_idx3                     3'h0
   20:19   R/W    adc_mode_idx3                   2'h0
   31:21   R      reserved14_31_21                11'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        uint32_t ch_num_idx2: 3;
        uint32_t adc_mode_idx2: 2;
        const uint32_t reserved_1: 11;
        uint32_t ch_num_idx3: 3;
        uint32_t adc_mode_idx3: 2;
        const uint32_t reserved_0: 11;
    } b;
} ADC_SCHED_TAB_IDX2_TypeDef;


/* 0x18
   2:0     R/W    ch_num_idx4                     3'h0
   4:3     R/W    adc_mode_idx4                   2'h0
   15:5    R      reserved18_15_5                 11'h0
   18:16   R/W    ch_num_idx5                     3'h0
   20:19   R/W    adc_mode_idx5                   2'h0
   31:21   R      reserved18_31_21                11'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        uint32_t ch_num_idx4: 3;
        uint32_t adc_mode_idx4: 2;
        const uint32_t reserved_1: 11;
        uint32_t ch_num_idx5: 3;
        uint32_t adc_mode_idx5: 2;
        const uint32_t reserved_0: 11;
    } b;
} ADC_SCHED_TAB_IDX4_TypeDef;


/* 0x1C
   2:0     R/W    ch_num_idx6                     3'h0
   4:3     R/W    adc_mode_idx6                   2'h0
   15:5    R      reserved1c_15_5                 11'h0
   18:16   R/W    ch_num_idx7                     3'h0
   20:19   R/W    adc_mode_idx7                   2'h0
   31:21   R      reserved1c_31_21                11'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        uint32_t ch_num_idx6: 3;
        uint32_t adc_mode_idx6: 2;
        const uint32_t reserved_1: 11;
        uint32_t ch_num_idx7: 3;
        uint32_t adc_mode_idx7: 2;
        const uint32_t reserved_0: 11;
    } b;
} ADC_SCHED_TAB_IDX6_TypeDef;


/* 0x20
   2:0     R/W    ch_num_idx8                     3'h0
   4:3     R/W    adc_mode_idx8                   2'h0
   15:5    R      reserved20_15_5                 11'h0
   18:16   R/W    ch_num_idx9                     3'h0
   20:19   R/W    adc_mode_idx9                   2'h0
   31:21   R      reserved20_31_21                11'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        uint32_t ch_num_idx8: 3;
        uint32_t adc_mode_idx8: 2;
        const uint32_t reserved_1: 11;
        uint32_t ch_num_idx9: 3;
        uint32_t adc_mode_idx9: 2;
        const uint32_t reserved_0: 11;
    } b;
} ADC_SCHED_TAB_IDX8_TypeDef;


/* 0x24
   2:0     R/W    ch_num_idx10                    3'h0
   4:3     R/W    adc_mode_idx10                  2'h0
   15:5    R      reserved24_15_5                 11'h0
   18:16   R/W    ch_num_idx11                    3'h0
   20:19   R/W    adc_mode_idx11                  2'h0
   31:21   R      reserved24_31_21                11'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        uint32_t ch_num_idx10: 3;
        uint32_t adc_mode_idx10: 2;
        const uint32_t reserved_1: 11;
        uint32_t ch_num_idx11: 3;
        uint32_t adc_mode_idx11: 2;
        const uint32_t reserved_0: 11;
    } b;
} ADC_SCHED_TAB_IDX10_TypeDef;


/* 0x28
   2:0     R/W    ch_num_idx[12]                  3'h0
   4:3     R/W    adc_mode_idx[12]                2'h0
   15:5    R      reserved28_15_5                 11'h0
   18:16   R/W    ch_num_idx13                    3'h0
   20:19   R/W    adc_mode_idx13                  2'h0
   31:21   R      reserved28_31_21                11'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        uint32_t ch_num_idx_12: 3;
        uint32_t adc_mode_idx_12: 2;
        const uint32_t reserved_1: 11;
        uint32_t ch_num_idx13: 3;
        uint32_t adc_mode_idx13: 2;
        const uint32_t reserved_0: 11;
    } b;
} ADC_SCHED_TAB_IDX12_TypeDef;


/* 0x2C
   2:0     R/W    ch_num_idx14                    3'h0
   4:3     R/W    adc_mode_idx14                  2'h0
   15:5    R      reserved2c_15_5                 11'h0
   18:16   R/W    ch_num_idx15                    3'h0
   20:19   R/W    adc_mode_idx15                  2'h0
   31:21   R      reserved2c_31_21                11'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        uint32_t ch_num_idx14: 3;
        uint32_t adc_mode_idx14: 2;
        const uint32_t reserved_1: 11;
        uint32_t ch_num_idx15: 3;
        uint32_t adc_mode_idx15: 2;
        const uint32_t reserved_0: 11;
    } b;
} ADC_SCHED_TAB_IDX14_TypeDef;


/* 0x30
   15:0    R      adc_idx0_output_data            16'h0
   31:16   R      adc_idx1_output_data            16'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t adc_idx0_output_data: 16;
        const uint32_t adc_idx1_output_data: 16;
    } b;
} ADC_IDX0_OUTPUT_DATA_TypeDef;


/* 0x34
   15:0    R      adc_idx2_output_data            16'h0
   31:16   R      adc_idx3_output_data            16'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t adc_idx2_output_data: 16;
        const uint32_t adc_idx3_output_data: 16;
    } b;
} ADC_IDX2_OUTPUT_DATA_TypeDef;


/* 0x38
   15:0    R      adc_idx4_output_data            16'h0
   31:16   R      adc_idx5_output_data            16'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t adc_idx4_output_data: 16;
        const uint32_t adc_idx5_output_data: 16;
    } b;
} ADC_IDX4_OUTPUT_DATA_TypeDef;


