wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/io/rtl876x_adc_def.h
/* 0x3C
   15:0    R      adc_idx6_output_data            16'h0
   31:16   R      adc_idx7_output_data            16'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t adc_idx6_output_data: 16;
        const uint32_t adc_idx7_output_data: 16;
    } b;
} ADC_IDX6_OUTPUT_DATA_TypeDef;


/* 0x40
   15:0    R      adc_idx8_output_data            16'h0
   31:16   R      adc_idx9_output_data            16'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t adc_idx8_output_data: 16;
        const uint32_t adc_idx9_output_data: 16;
    } b;
} ADC_IDX8_OUTPUT_DATA_TypeDef;


/* 0x44
   15:0    R      adc_idx10_output_data           16'h0
   31:16   R      adc_idx11_output_data           16'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t adc_idx10_output_data: 16;
        const uint32_t adc_idx11_output_data: 16;
    } b;
} ADC_IDX10_OUTPUT_DATA_TypeDef;


/* 0x48
   15:0    R      adc_idx12_output_data           16'h0
   31:16   R      adc_idx13_output_data           16'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t adc_idx12_output_data: 16;
        const uint32_t adc_idx13_output_data: 16;
    } b;
} ADC_IDX12_OUTPUT_DATA_TypeDef;


/* 0x4C
   15:0    R      adc_idx14_output_data           16'h0
   31:16   R      adc_idx15_output_data           16'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t adc_idx14_output_data: 16;
        const uint32_t adc_idx15_output_data: 16;
    } b;
} ADC_IDX14_OUTPUT_DATA_TypeDef;


/* 0x50
   1:0     R/W    adc_rg0x_auxadc_0_delay_sel     2'h0
   3:2     R/W    adc_rg0x_auxadc_1_delay_sel     2'h0
   5:4     R/W    adc_rg2x_auxadc_0_delay_sel     2'h0
   8:6     R/W    adc_data_delay                  3'h0
   9       R      reserved50_9                    1'h0
   14:10   R/W    adc_poweron_select              5'h0
   15      R/W    adc_poweron_only_en             1'h0
   18:16   R      reserved50_18_16                3'h0
   19      R/W    adc_manual_poweron              1'h0
   20      R/W    dummy50_20                      1'h0
   21      R/W    adc_fifo_stop_wr                1'h0
   23:22   R      reserved50_23_22                2'h0
   24      R/W    adc_data_avg_en                 1'h0
   27:25   R/W    adc_data_avg_sel                3'h0
   30:28   R      reserved50_30_28                3'h0
   31      R/W    adc_ctc_dis                     1'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        uint32_t adc_rg0x_auxadc_0_delay_sel: 2;
        uint32_t adc_rg0x_auxadc_1_delay_sel: 2;
        uint32_t adc_rg2x_auxadc_0_delay_sel: 2;
        uint32_t adc_data_delay: 3;
        const uint32_t reserved_3: 1;
        uint32_t adc_poweron_select: 5;
        uint32_t adc_poweron_only_en: 1;
        const uint32_t reserved_2: 3;
        uint32_t adc_manual_poweron: 1;
        uint32_t dummy50_20: 1;
        uint32_t adc_fifo_stop_wr: 1;
        const uint32_t reserved_1: 2;
        uint32_t adc_data_avg_en: 1;
        uint32_t adc_data_avg_sel: 3;
        const uint32_t reserved_0: 3;
        uint32_t adc_ctc_dis: 1;
    } b;
} ADC_POW_DATA_DLY_CTRL_TypeDef;


/* 0x54
   7:0     R      reserved54_7_0                  8'h0
   8       R/W    adc_keep_ck_ad_high             1'h0
   10:9    R      reserved54_10_9                 2'h0
   12:11   R/W    adc_delay_tune_sel              2'h0
   15:13   R      reserved54_15_13                3'h0
   27:16   R/W    adc_data_offset                 12'h0
   28      R      reserved54_28                   1'h0
   29      R/W    adc_timer_trigger_en            1'h0
   30      R/W    adc_data_align_msb              1'h0
   31      R/W    adc_data_offset_en              1'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t reserved_3: 8;
        uint32_t adc_keep_ck_ad_high: 1;
        const uint32_t reserved_2: 2;
        uint32_t adc_delay_tune_sel: 2;
        const uint32_t reserved_1: 3;
        uint32_t adc_data_offset: 12;
        const uint32_t reserved_0: 1;
        uint32_t adc_timer_trigger_en: 1;
        uint32_t adc_data_align_msb: 1;
        uint32_t adc_data_offset_en: 1;
    } b;
} ADC_DATA_CLK_CTRL_TypeDef;


/* 0x58
   0       R/W    pow                             1'h0
   1       R/W    pow_ref                         1'h0
   2       R/W    reg_ck                          1'h0
   3       R/W    reg_delay                       1'h0
   5:4     R/W    reg_vref_sel[1:0]               2'h2
   6       R/W    reg_revck                       1'h0
   8:7     R/W    reg_cmpdec[1:0]                 2'h0
   9       R/W    reg_meta                        1'h0
   10      R/W    sel_ln                          1'h0
   11      R/W    sel_lna                         1'h0
   13:12   R/W    reg_vcm_sel                     2'h0
   14      R/W    RG0X_AUXADC_DUMMY               1'h0
   15      R/W    RG0X_AUXADC_CTRL_SEL            1'h0
   31:16   R      reserved58_31_16                16'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        uint32_t pow: 1;
        uint32_t pow_ref: 1;
        uint32_t reg_ck: 1;
        uint32_t reg_delay: 1;
        uint32_t reg_vref_sel_1_0: 2;
        uint32_t reg_revck: 1;
        uint32_t reg_cmpdec_1_0: 2;
        uint32_t reg_meta: 1;
        uint32_t sel_ln: 1;
        uint32_t sel_lna: 1;
        uint32_t reg_vcm_sel: 2;
        uint32_t RG0X_AUXADC_DUMMY: 1;
        uint32_t RG0X_AUXADC_CTRL_SEL: 1;
        const uint32_t reserved_0: 16;
    } b;
} ADC_ANALOG_CTRL_TypeDef;


/* 0x5C
   13:0    R/W    adc_sample_time_period          14'h0
   29:14   R      reserved5c_29_14                16'h0
   31:30   R/W    adc_convert_time_period_sel     2'h0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        uint32_t adc_sample_time_period: 14;
        const uint32_t reserved_0: 16;
        uint32_t adc_convert_time_period_sel: 2;
    } b;
} ADC_TIME_PERIOD_TypeDef;


/* 0x60
   31:0    R      RTLversion                      32'h20240530
*/
typedef union
{
    uint32_t d32;
    struct
    {
        const uint32_t RTLversion: 32;
    } b;
} ADC_RTL_VERSION_TypeDef;


