wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/io/rtl876x_adc_def.h
/*============================================================================*
 *                         Constants
 *============================================================================*/
/**
 * \defgroup    ADC_Interrupts_Definition ADC Interrupts Definition
 * \{
 * \ingroup     ADC_Exported_Constants
 */
#define ADC_INT_FIFO_RD_REQ           ((uint32_t)(1 << 0))
#define ADC_INT_FIFO_RD_ERR           ((uint32_t)(1 << 1))
#define ADC_INT_FIFO_THD              ((uint32_t)(1 << 2))
#define ADC_INT_FIFO_FULL             ((uint32_t)(1 << 3))
#define ADC_INT_ONE_SHOT_DONE         ((uint32_t)(1 << 4))

#define IS_ADC_INT(INT) (((INT) == ADC_INT_FIFO_RD_REQ) || \
                         ((INT) == ADC_INT_FIFO_RD_ERR) || \
                         ((INT) == ADC_INT_FIFO_THD) || \
                         ((INT) == ADC_INT_ONE_SHOT_DONE) || \
                         ((INT) == ADC_INT_FIFO_FULL))

/** End of ADC_Interrupts_Definition
  * \}
  */

/*============================================================================*
 *                         ADC WRAPPER
 *============================================================================*/
#define adcClock                              ADC_SampleTime
#define adcConvertTimePeriod                  ADC_ConvertTime
#define dataWriteToFifo                       ADC_DataWriteToFifo
#define adcFifoThd                            ADC_FifoThdLevel
#define adcBurstSize                          ADC_WaterLevel
#define adcFifoOverWritEn                     ADC_FifoOverWriteEn
#define dataLatchEdge                         ADC_DataLatchEdge
#define schIndex                              ADC_SchIndex
#define bitmap                                ADC_Bitmap
#define timerTriggerEn                        ADC_TimerTriggerEn
#define dataAligned                           ADC_DataAlign
#define dataMinusEn                           ADC_DataMinusEn
#define dataMinusOffset                       ADC_DataMinusOffset
#define pwrmode                               ADC_PowerOnMode
#define datalatchDly                          ADC_DataLatchDly
#define adcRG2X0Dly                           ADC_RG2X0Dly
#define adcRG0X1Dly                           ADC_RG0X1Dly
#define adcRG0X0Dly                           ADC_RG0X0Dly
#define adc_fifo_stop_write                   ADC_FifoStopWriteEn
#define adcPowerAlwaysOnCmd                   ADC_PowerAlwaysOnEn

/**
 * \brief    ADC Macro Wrapper
 *
 * \ingroup  ADC_Exported_Constants
 */
#define ADC_Latch_Data_Positive               ADC_LATCH_DATA_Positive
#define ADC_Latch_Data_Negative               ADC_LATCH_DATA_Negative
#define ADC_DATA_LSB                          ADC_DATA_ALIGN_LSB
#define ADC_DATA_MSB                          ADC_DATA_ALIGN_MSB
#define T_ADC_DTAT_AVG_SEL                    ADC_DATA_AVG_SEL_TypeDef
#define ADC_DTAT_AVG_SEL_BY2                  ADC_DATA_AVERAGE_OF_2
#define ADC_DTAT_AVG_SEL_BY4                  ADC_DATA_AVERAGE_OF_4
#define ADC_DTAT_AVG_SEL_BY8                  ADC_DATA_AVERAGE_OF_8
#define ADC_DTAT_AVG_SEL_BY16                 ADC_DATA_AVERAGE_OF_16
#define ADC_DTAT_AVG_SEL_BY32                 ADC_DATA_AVERAGE_OF_32
#define ADC_DTAT_AVG_SEL_BY64                 ADC_DATA_AVERAGE_OF_64
#define ADC_DTAT_AVG_SEL_BY128                ADC_DATA_AVERAGE_OF_128
#define ADC_DTAT_AVG_SEL_BY256                ADC_DATA_AVERAGE_OF_256
#define ADC_DTAT_AVG_SEL_MAX                  ADC_DATA_AVERAGE_MAX
#define ADC_POWER_AUTO                        ADC_POWER_ON_AUTO
#define ADC_POWER_MANNUAL                     ADC_POWER_ON_MANUAL
#define ADC_Continuous_Mode                   ADC_CONTINUOUS_MODE
#define ADC_One_Shot_Mode                     ADC_ONE_SHOT_MODE
#define ADC_INT_FIFO_TH                       ADC_INT_FIFO_THD

#define ADC_DATA_MINUS_EN                     ENABLE
#define ADC_DATA_MINUS_DIS                    DISABLE
#define ADC_ONE_SHOT_FIFO_ENABLE              ENABLE
#define ADC_ONE_SHOT_FIFO_DISABLE             DISABLE
#define ADC_FIFO_OVER_WRITE_ENABLE            ENABLE
#define ADC_FIFO_OVER_WRITE_DISABLE           DISABLE
#define ADC_POWER_ALWAYS_ON_ENABLE            ENABLE
#define ADC_POWER_ALWAYS_ON_DISABLE           DISABLE
#define IS_ADC_GET_IT(IT) IS_ADC_IT(IT)

/**
 * \brief    ADC API Wrapper
 *
 * \ingroup  ADC_Exported_Constants
 */
#define ADC_Read                          ADC_ReadRawData
#define ADC_HwEvgRead                     ADC_ReadAvgRawData
#define ADC_ReadFifoData                  ADC_ReadFIFO
#define ADC_GetFifoData                   ADC_ReadFIFOData
#define ADC_GetFifoLen                    ADC_GetFIFODataLen
#define ADC_OneshotFifoSet                ADC_WriteFIFOCmd
#define ADC_HighBypassCmd                 ADC_BypassCmd
#define ADC_ClearFifo                     ADC_ClearFIFO
#define ADC_SchTableSet                   ADC_BitMapConfig
#define ADC_GetIntStatus                  ADC_GetAllFlagStatus
#define ADC_GetIntFlagStatus              ADC_GetINTStatus

/**
 * \defgroup ADC_Constant_Wrapper ADC Constant Wrapper
 * \{
 * \ingroup  ADC_Exported_Constants
 */
#define ADC_MODE_SINGLE_ENDED_VALUE     0x1
#define ADC_MODE_DIFFERENTIAL_VALUE     0x2
#define ADC_MODE_INTERNAL_VALUE         0x3
#define ADC_MODE_RESERVED_VALUE         0x0


#ifdef  __cplusplus
}
#endif /* __cplusplus */

#endif /* RTL876X_ADC_DEF_H */
